'use client';
import { create } from "zustand";

export const useHadithStore = create(set => ({
    data: [{
        id: 1,
        hadith: "عَنِ ابنِ عباسٍ - رضي اللهُ عنهما - قال: قال رسولُ اللهِ صلَّى اللهُ عليه وسلَّم: « نِعمَتانِ مغبونٌ فيهما كثيرٌ من الناسِ: الصَّحَّةُ والفَّراغُ» رواه البخاري.",
    }, {
        id: 2,
        hadith: "عن أبي عمارة البراء بن عازب رضي الله عنهما قال : قال رسول الله ﷺ :  يا فلان إذا أويت إلى فراشك فقل: اللهم أسلمت نفسي إليك، ووجهت وجهي إليك: وفوضت أمري إليك ، وألجأت ظهري إليك، رغبة ورهبة إليك، لا ملجأ ولا منجى منك إلا إليك ، آمنت بكتابك الذي أنزلت، ونبيك الذي أرسلت؛ فإنك إن مت من ليلتك مت على الفطرة، وإن أصبحت أصبت خيراً",
    }, {
        id: 3,
        hadith: 'عن أم المؤمنين أم الحكم زينب بنت جحش رَضِيِ اللَّهُ عَنْها أن النبي ﷺ دخل عليها فزعاً يقول: (لا إله إلا اللَّه! ويل للعرب من شر قد أقترب! فتح اليوم من ردم يأجوج ومأجوج مثل هذه) وحلق بأصبعيه: الإبهام والتي تليها. فقلت: يا رَسُول اللَّهِ أنهلك وفينا الصالحون قال: (نعم إذا كثر الخبث) مُتَّفَقٌ عَلَيْهِ.'
    }, {
        id: 4,
        hadith: 'عن عبد اللَّه بن عمرو بن العاص رَضِيَ اللَّهُ عَنهُ قال: لم يكن رَسُول اللَّهِ ﷺ فاحشاً ولا متفحشاً، وكان يقول: (إن من خياركم أحسنكم أخلاقا) مُتَّفَقٌ عَلَيهِ.'
    }, {
        id: 5,
        hadith: 'عن أنس رَضِيَ اللَّهُ عَنهُ عن رَسُول اللَّهِ ﷺ قال: (يتبع الميت ثلاثة: أهله وماله وعمله؛ فيرجع اثنان ويبقى واحد: يرجع أهله وماله، ويبقى عمله) مُتَّفَقٌ عَلَيهِ.'
    }, {
        id: 6,
        hadith: 'عن أبي ذر رَضِيَ اللَّهُ عَنْهُ أن رَسُول اللَّهِ ﷺ قال : (يصبح على كل سلامى من أحدكم صدقة، فكل تسبيحة صدقة، وكل تحميدة صدقة، وكل تهليلة صدقة، وكل تكبيرة صدقة، وأمر بالمعروف صدقة، ونهي عن المنكر صدقة؛ ويجزئ من ذلك ركعتان يركعهما من الضحى) رَوَاهُ مُسْلِمٌ.'
    }],
    setData: () => set(state => ({ data: data })),
}));


